---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures
source: html/c6c38309-58da-efcd-bf35-3fa6f5a5a718.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures

Failures about Constraint.

## Syntax (C#)
```csharp
public static class ConstraintFailures
```